load-test.yml
config:
  target: 'https://rubi-makeovers.vercel.app'
  phases:
    # Phase 1: Ramp up - gradually increase load
    - duration: 60
      arrivalRate: 5
      name: 'Warm up'
    # Phase 2: Sustained load - stable concurrent users
    - duration: 120
      arrivalRate: 20
      name: 'Sustained load'
    # Phase 3: Peak load - push to limits
    - duration: 60
      arrivalRate: 50
      name: 'Peak load'
    # Phase 4: Cool down - reduce load
    - duration: 60
      arrivalRate: 10
      name: 'Cool down'
  processor: './load-test-processor.js'
  variables:
    baseUrl: 'https://rubi-makeovers.vercel.app'
  processor_javascript_runtime: 'nodejs'

scenarios:
  - name: 'Homepage & Browsing'
    weight: 40
    flow:
      - get:
          url: '/'
          expect:
            - statusCode: 200
      - think: 2
      - get:
          url: '/about'
          expect:
            - statusCode: 200
      - think: 2
      - get:
          url: '/packages'
          expect:
            - statusCode: 200

  - name: 'Package Browsing by Service'
    weight: 30
    flow:
      - get:
          url: '/'
          expect:
            - statusCode: 200
      - think: 1
      - get:
          url: '/packages?service=bridal-makeup'
          expect:
            - statusCode: 200
      - think: 1
      - get:
          url: '/packages?service=engagement-makeup'
          expect:
            - statusCode: 200
      - think: 1
      - get:
          url: '/packages?service=pre-bridal'
          expect:
            - statusCode: 200

  - name: 'Booking Flow'
    weight: 20
    flow:
      - get:
          url: '/'
          expect:
            - statusCode: 200
      - think: 2
      - get:
          url: '/book'
          expect:
            - statusCode: 200
      - think: 3

  - name: 'Footer & Info Pages'
    weight: 10
    flow:
      - get:
          url: '/'
          expect:
            - statusCode: 200
      - think: 1
      - get:
          url: '/faq'
          expect:
            - statusCode: 200
      - think: 1
      - get:
          url: '/contact'
          expect:
            - statusCode: 200
      - think: 1
      - get:
          url: '/portfolio'
          expect:
            - statusCode: 200